
#include <iostream>

using namespace std;

int main()
{
    //以0开头的整数代表八进制，以0x或0X开头的代表十六进制
    //默认情况下，十进制字面值是带符号数，八进制和十六进制字面值既可能是带
    //符号的也可能是无符号的。
    int i1 = 20, i2 = 024, i3 = 0x14, i4 = 0X14;
    cout << "i1: " << i1 << ", i2: " << i2 << ", i3: " << i3 << ", i4: " << i4 << endl;

    //浮点型字面值表现为一个小数或以科学计数法表示的指数，其中指数部分用
    //E或e来标识，浮点型字面值默认为double型。
    cout << 3.14159 << ", " << 3.14159E3 << ", " << 0. << ", " << 0e0 << ", " << .001 << ", " << 1.4e4 << endl;

    //单引号：char型(字符)字面值，双引号：字符串字面值
    //字符串字面值的类型实际上是由常量字符构成的数组(array)。编译器在每个字
    //符串的结尾处添加一个空字符('\0')，因此字符串字面值的实际长度要比它的
    //内容多1。如字符串"A"就代表了一个字符的数组，该数组包含两个字符：一个
    //是字母A，另一个是空字符。
    cout << 'a' << ", " << "A" << endl;

    return 0;
}
